In [5]:
# we import the library pandas and give it the "pd" kickname
import pandas as pd
import numpy as np

# **For all questions YOU HAVE TO WRITE SOME CORRECT  PYTHON CODE! simply giving the final answer is not enough!**

### Assignment 4.1
#### (a) Create two variables called A and B in Python and Assign them values of 500 and 1000.
#### (b) Create variable C which holds the sum of A and B and variable D that holds their multiplication

#### Hint: You can do this using basic python functionality without operations from Pandas

## (a)

In [2]:
A=500
B=1000

## (b)

In [3]:
C=A+B
D=A*B
print(C,D)

1500 500000

In [ ]:
df=pd.read_csv('https://www.dropbox.com/s/j5neg35o0dm6b5k/jobseekers.csv?dl=1')
df.shape

### You will work on the following dataframe for the rest of assignments
#### This dataframe contains the name of people who are seeking jobs, their zipcode, number of months on the job market, number of times contacted by a recruiter and the job they are seeking

In [6]:
df=pd.read_csv('https://www.dropbox.com/s/j5neg35o0dm6b5k/jobseekers.csv?dl=1')
df.head()

,FirstName,PostCode,OnMarket,NumContacts,JobSought
0,jasmine,EX2 9BY,4,2.0,Emergency planning/management officer
1,mazeed,EX4 2BD,6,5.0,"Nurse, learning disability"
2,sandra,EX2 4AY,2,2.0,"Therapist, horticultural"
3,brooke,EX2 6HD,2,1.0,Media planner
4,tuhfa,EX2 6BW,2,2.0,Ranger/warden

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1861 entries, 0 to 1860
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   FirstName    1861 non-null   object
 1   PostCode     1860 non-null   object
 2   OnMarket     1861 non-null   int64
 3   NumContacts  1861 non-null   float64
 4   JobSought    1861 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 72.8+ KB

### Assignment 4.2
#### (a) How many rows and columns are in the dataframe (you need to write a line of code for this)
#### (b) Extract the columns "FirstName" and "NumContacts" (the outcome should have two columns not seperated single columns)
#### (c) Extract rows number 100, 150, 200, 250
#### (d) Extract columns "FirstName" and "Postcode" for rows 1000 and 1500

## (a)

In [8]:
df.shape

(1861, 5)

## (b)

In [9]:
df[['FirstName','NumContacts']]

          FirstName  NumContacts
0           jasmine          2.0
1            mazeed          5.0
2            sandra          2.0
3            brooke          1.0
4             tuhfa          2.0
...             ...          ...
1856         daniel          5.0
1857  abdur razzaaq          2.0
1858          paris          2.0
1859          salwa          2.0
1860       nicholas          2.0

[1861 rows x 2 columns]

## (c)

In [10]:
df.iloc[[100, 150, 200, 250]]

,FirstName,PostCode,OnMarket,NumContacts,JobSought
100,diana,EX2 8RS,1,2.0,Building services engineer
150,drew,EX4 4XD,2,3.0,Higher education careers adviser
200,anastasia,EX4 2PN,1,2.0,Community development worker
250,sharad,EX2 9BY,3,2.0,IT consultant

## (d)

In [12]:
df[['FirstName', 'PostCode']].iloc[[1000,1500]]

     FirstName PostCode
1000      alec  EX4 2PN
1500    mazeed  EX4 2BD

In [14]:
df.iloc[[1000,1500]][['FirstName', 'PostCode']]

     FirstName PostCode
1000      alec  EX4 2PN
1500    mazeed  EX4 2BD

### Assignment 4.3
#### (a) Find the maximum number of times a person was contacted by the recruiters
#### (b) Find the minimum number of months a person was on the market 
#### (c) Find the average time people have been contacted by the recruiters

## (a)

In [18]:
df['NumContacts'].max()

7.0

## (b)

In [19]:
df['OnMarket'].min()

-2

## (c)

In [20]:
df['NumContacts'].mean()

2.648038688876948

### Assignment 4.4
#### (a) Find individuals who have been contacted at least 3 times by the recruiters
#### (b) Find individuals who have been on the job market less than 2 months or more than 6 months
#### (c) Find individuals with PostCode "EX2 9BY"
#### (d) Find individuals who looking for a job as a "nurse"
#### (e) Find the average time people from PostCode "EX4 2BD" were on the market
#### (f) For people who where contacted between 2 and 5 times, and seeking professor job, find the maximum and minimum time on the market

## (a)

In [23]:
NumContactsFilter=df['NumContacts']>=3
df[NumContactsFilter]

,FirstName,PostCode,OnMarket,NumContacts,JobSought
1,mazeed,EX4 2BD,6,5.0,"Nurse, learning disability"
5,gabriela,EX1 1NX,3,3.0,"Accountant, chartered certified"
6,alexis,EX2 6HD,4,3.0,IT consultant
9,muthanna,EX1 9NX,7,5.0,"Journalist, magazine"
10,jazmin angel,EX4 4XD,4,3.0,Software engineer
...,...,...,...,...,...
1851,matthew,EX1 1NX,3,3.0,Sports coach
1852,westin,EX1 3LF,3,3.0,Lexicographer
1853,christina,EX2 8BN,3,3.0,Multimedia programmer
1855,alexander,EX4 4XD,7,5.0,Information officer
1856,daniel,EX2 9JX,4,5.0,"Scientist, marine"

## (b)

In [31]:
onmarketfilter=(df['OnMarket']<2)|(df['OnMarket']>5)
df[onmarketfilter]

      FirstName PostCode  OnMarket  NumContacts                   JobSought
1        mazeed  EX4 2BD         6          5.0  Nurse, learning disability
7        jaclyn  EX4 8AY         1          1.0    Insurance claims handler
8         diana  EX2 8RS         1          2.0  Building services engineer
9      muthanna  EX1 9NX         7          5.0        Journalist, magazine
12      shameem  EX4 6QL         1          1.0          Professor Emeritus
...         ...      ...       ...          ...                         ...
1837  alexander  EX4 8AY         1          1.0    Insurance claims handler
1839      tyler  EX2 6BH         1          1.0       Aeronautical engineer
1840    michael  EX4 8PD         1          1.0            Textile designer
1855  alexander  EX4 4XD         7          5.0         Information officer
1858      paris  EX4 4XD         1          2.0                Sports coach

[408 rows x 5 columns]

## (c)

In [33]:
onmarketfilter2=(df['OnMarket']>=2)&(df['OnMarket']<=5)
df[~onmarketfilter2]

      FirstName PostCode  OnMarket  NumContacts                   JobSought
1        mazeed  EX4 2BD         6          5.0  Nurse, learning disability
7        jaclyn  EX4 8AY         1          1.0    Insurance claims handler
8         diana  EX2 8RS         1          2.0  Building services engineer
9      muthanna  EX1 9NX         7          5.0        Journalist, magazine
12      shameem  EX4 6QL         1          1.0          Professor Emeritus
...         ...      ...       ...          ...                         ...
1837  alexander  EX4 8AY         1          1.0    Insurance claims handler
1839      tyler  EX2 6BH         1          1.0       Aeronautical engineer
1840    michael  EX4 8PD         1          1.0            Textile designer
1855  alexander  EX4 4XD         7          5.0         Information officer
1858      paris  EX4 4XD         1          2.0                Sports coach

[408 rows x 5 columns]

## (d)

In [36]:
NurseFilter=df['JobSought'].str.contains('Nurse')
df[NurseFilter]

     FirstName PostCode  OnMarket  NumContacts                   JobSought
1       mazeed  EX4 2BD         6          5.0  Nurse, learning disability
14       wanda  EX4 5DW         1          1.0  Nurse, learning disability
56      daniel  EX2 6BW         7          7.0  Nurse, learning disability
92      mazeed  EX4 2BD         6          5.0  Nurse, learning disability
144      wanda  EX4 5DW         1          1.0  Nurse, learning disability
151      brian  EX1 9NX         2          3.0  Nurse, learning disability
190      wanda  EX4 5DW         1          1.0  Nurse, learning disability
302     daniel  EX2 6BW         7          7.0  Nurse, learning disability
314     mazeed  EX4 2BD         6          5.0  Nurse, learning disability
489     mazeed  EX4 2BD         6          5.0  Nurse, learning disability
496     daniel  EX2 6BW         7          7.0  Nurse, learning disability
652     mazeed  EX4 2BD         6          5.0  Nurse, learning disability
658     daniel  EX2 6BW         7          7.0  Nurse, learning disability
671     mazeed  EX4 2BD         6          5.0  Nurse, learning disability
705      brian  EX1 9NX         2          3.0  Nurse, learning disability
707      brian  EX1 9NX         2          3.0  Nurse, learning disability
711     mazeed  EX4 2BD         6          5.0  Nurse, learning disability
847      wanda  EX4 5DW         1          1.0  Nurse, learning disability
955      brian  EX1 9NX         2          3.0  Nurse, learning disability
1224    daniel  EX2 6BW         7          7.0  Nurse, learning disability
1355    mazeed  EX4 2BD         6          5.0  Nurse, learning disability
1500    mazeed  EX4 2BD         6          5.0  Nurse, learning disability
1571     brian  EX1 9NX         2          3.0  Nurse, learning disability
1599     wanda  EX4 5DW         1          1.0  Nurse, learning disability
1611     wanda  EX4 5DW         1          1.0  Nurse, learning disability
1678    daniel  EX2 6BW         7          7.0  Nurse, learning disability
1771    mazeed  EX4 2BD         6          5.0  Nurse, learning disability
1787    daniel  EX2 6BW         7          7.0  Nurse, learning disability

## (d)

In [37]:
PostCodeFilter2 = df['PostCode']=='EX4 2BD'
df[PostCodeFilter2]['OnMarket'].mean()

2.6422018348623855

# For people who were contacted between 2 and 5 times, and seeking professor job, find the maximum and minimum time on the market

In [40]:
filter1=(df['NumContacts']>=2 ) & (df['NumContacts']<=5) & (df['JobSought'].str.contains('Professor'))

In [42]:
df[filter1]['OnMarket'].max(),df[filter1]['OnMarket'].min()

(2, 1)